4ms/stm32mp1-baremetal/ctest/Drivers/BSP/STM32MP15xx_DISCO/stm32mp15xx_disco.c
/**
  ******************************************************************************
  * @file    stm32mp15xx_disco.c
  * @author  MCD Application Team
  * @brief   This file provides a set of firmware functions to manage LEDs, 
  *          push-buttons and COM ports available on STM32MP15xx-DISCO 
  *          discovery board from STMicroelectronics.
  *
  @verbatim
  *
  @endverbatim
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics. 
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the 
  * License. You may obtain a copy of the License at:
  *                       opensource.org/licenses/BSD-3-Clause
  *
  *
  ******************************************************************************
  */ 
  
/* Includes ------------------------------------------------------------------*/
#include "stm32mp15xx_disco.h"

/** @addtogroup BSP
  * @{
  */ 

/** @addtogroup STM32MP15XX_DISCO
  * @{
  */

/** @defgroup STM32MP15XX_DISCO_LOW_LEVEL_Private_TypesDefinitions Private Typedef
  * @{
  */
typedef void (* BSP_EXTI_LineCallback)(void);
/**
  * @}
  */

/** @defgroup STM32MP15XX_DISCO_LOW_LEVEL_Private_Defines Private Def
  * @{
  */

/** @brief STM32MP15XX DISCO BSP Driver version number V2.0.0
  */
#define STM32MP15XX_DISCO_BSP_VERSION_MAIN   (0x01U) /*!< [31:24] main version */
#define STM32MP15XX_DISCO_BSP_VERSION_SUB1   (0x02U) /*!< [23:16] sub1 version */
#define STM32MP15XX_DISCO_BSP_VERSION_SUB2   (0x00U) /*!< [15:8]  sub2 version */
#define STM32MP15XX_DISCO_BSP_VERSION_RC     (0x00U) /*!< [7:0]  release candidate */
#define STM32MP15XX_DISCO_BSP_VERSION         ((STM32MP15XX_DISCO_BSP_VERSION_MAIN << 24)\
                                             |(STM32MP15XX_DISCO_BSP_VERSION_SUB1 << 16)\
                                             |(STM32MP15XX_DISCO_BSP_VERSION_SUB2 << 8 )\
                                             |(STM32MP15XX_DISCO_BSP_VERSION_RC))
/**
  * @}
  */


/** @defgroup STM32MP15XX_DISCO_LOW_LEVEL_Private_Variables Private Variables
  * @{
  */

static GPIO_TypeDef* LED_PORT[LEDn] = {LED6_GPIO_PORT,
                                       LED5_GPIO_PORT,
                                       LED7_GPIO_PORT,
                                       LED8_GPIO_PORT};

static const uint32_t LED_PIN[LEDn] = {LED6_PIN,
                                       LED5_PIN,
                                       LED7_PIN,
                                       LED8_PIN};


static GPIO_TypeDef* BUTTON_PORT[BUTTONn] = {WAKEUP_BUTTON_GPIO_PORT,
                                             USER_BUTTON_GPIO_PORT,
                                             USER2_BUTTON_GPIO_PORT};

static const uint16_t BUTTON_PIN[BUTTONn] = {WAKEUP_BUTTON_PIN,
                                             USER_BUTTON_PIN,
                                             USER2_BUTTON_PIN};

static const uint16_t BUTTON_IRQn[BUTTONn] = {WAKEUP_BUTTON_EXTI_IRQn,
                                              USER_BUTTON_EXTI_IRQn,
                                              USER2_BUTTON_EXTI_IRQn};

#ifdef HAL_EXTI_MODULE_ENABLED
EXTI_HandleTypeDef   hExtiButtonHandle[BUTTONn];
#endif

#if (USE_BSP_COM_FEATURE == 1)
#ifdef HAL_UART_MODULE_ENABLED
static USART_TypeDef* COM_USART[COMn] = {COM1_UART};

static UART_HandleTypeDef hComHandle[COMn];

#if (USE_COM_LOG == 1)
static COM_TypeDef COM_ActiveLogPort = COM1;
#endif

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
static uint32_t IsComMspCbValid[COMn] = {0};
#endif

#endif
#endif /* (USE_BSP_COM_FEATURE == 1) */

/**
  * @}
  */


/** @defgroup STM32MP15XX_DISCO_LOW_LEVEL_Private_FunctionPrototypes Private Prototypes
  * @{
  */
#ifdef HAL_EXTI_MODULE_ENABLED
static void BUTTON_WAKEUP_EXTI_Callback(void);
static void BUTTON_USER_EXTI_Callback(void);
static void BUTTON_USER2_EXTI_Callback(void);
#endif

#if (USE_BSP_COM_FEATURE == 1)
#ifdef HAL_UART_MODULE_ENABLED
static void COM1_MspInit(UART_HandleTypeDef *huart);
static void COM1_MspDeInit(UART_HandleTypeDef *huart);
#endif
#endif /* (USE_BSP_COM_FEATURE == 1) */
/**
  * @}
  */

  
/** @addtogroup STM32MP15XX_DISCO_LOW_LEVEL_Exported_Functions Exported Functions
  * @{
  */ 

  /**
  * @brief  This method returns the STM32MP15XX DISCO BSP Driver revision
  * @retval version: 0xXYZR (8bits for each decimal, R for RC)
  */
uint32_t BSP_GetVersion(void)
{
  return STM32MP15XX_DISCO_BSP_VERSION;
}

/** @addtogroup STM32MP15XX_DISCO_LOW_LEVEL_Exported_Functions_Group1 LED Functions
  * @{
  */
/**
  * @brief  Configures LEDs.
  * @param  Led LED to be configured.
  *          This parameter can be one of the following values:
  *            @arg  LED5
  *            @arg  LED6
  *            @arg  LED7
  *            @arg  LED8
  */
int32_t BSP_LED_Init(Led_TypeDef Led)
{
int32_t  status = BSP_ERROR_NONE;
  GPIO_InitTypeDef  gpio_init_structure;

  /* Enable the GPIO_LED clock */
  if(Led == LED6)
  {
    LED6_GPIO_CLK_ENABLE();
  }
  else if (Led == LED5)
  {
    LED5_GPIO_CLK_ENABLE();
  }
  else if (Led == LED7)
  {
    LED7_GPIO_CLK_ENABLE();
  }
  else if (Led == LED8)
  {
    LED8_GPIO_CLK_ENABLE();
  }

    /* Configure the GPIO_LED pin */
  gpio_init_structure.Pin = LED_PIN[Led];
  gpio_init_structure.Mode = GPIO_MODE_OUTPUT_PP;
  gpio_init_structure.Pull = GPIO_PULLUP;
  gpio_init_structure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  BSP_ENTER_CRITICAL_SECTION(LED_PORT[Led]);
  HAL_GPIO_Init(LED_PORT[Led], &gpio_init_structure);
  BSP_EXIT_CRITICAL_SECTION(LED_PORT[Led]);
  
  /* By default, turn off LED */
  BSP_LED_Off(Led);

return status;
}


/**
  * @brief  DeInit LEDs.
  * @param  Led LED to be configured.
  *          This parameter can be one of the following values:
  *            @arg  LED5
  *            @arg  LED6
  *            @arg  LED7
  *            @arg  LED8
  * @note Led DeInit does not disable the GPIO clock.
  */
int32_t BSP_LED_DeInit(Led_TypeDef Led)
{
int32_t  status = BSP_ERROR_NONE;
  GPIO_InitTypeDef  gpio_init_structure;
  /* Turn off LED */
  BSP_LED_Off(Led);
    /* Configure the GPIO_LED pin */
  gpio_init_structure.Pin = LED_PIN[Led];
  BSP_ENTER_CRITICAL_SECTION(LED_PORT[Led]);
  HAL_GPIO_DeInit(LED_PORT[Led], gpio_init_structure.Pin);
  BSP_EXIT_CRITICAL_SECTION(LED_PORT[Led]);

